<?xml version='1.0' encoding='utf-8' standalone='yes'?>
<policyDefinitionResources
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    revision="1.0"
    schemaVersion="1.0"
    >
  <displayName>Delivery Optimization GP</displayName>
  <description>This file describes the Delivery Optimization GP settings</description>
  <resources>
    <stringTable>
      <string id="DeliveryOptimizationCat">Delivery Optimization</string>
      <string id="DownloadMode">Download Mode</string>
      <string id="DownloadMode_Help">Set this policy to configure the use of Windows Update Delivery Optimization in downloads of Windows Apps and Updates. Available mode are: 0=disable  1=peers on same NAT only 2=Local Network / Private Peering (PCs in the same domain by default) 3= Internet Peering</string>
      <string id="DownloadMode_None">None</string>
      <string id="DownloadMode_Lan">LAN</string>
      <string id="DownloadMode_Group">Group</string>
      <string id="DownloadMode_Internet">Internet</string>
      <string id="GroupId">Group ID</string>
      <string id="GroupId_Help">Set this policy to specify an arbitrary group ID that the device belongs to. Use this if you need to: 1. Limit the #of devices participating in peering in a domain network with many users. 2. Create a single group for Local Network Peering for branches that are on different domains or are not on the same NAT. Note: this is a best effort optimization and should not be relied on for an authentication of identity. You must use a GUID as the group ID.</string>
      <string id="MaxUploadBandwidth">Max Upload Bandwidth</string>
      <string id="MaxUploadBandwidth_Help">Set this policy to define a cap for the upload bandwidth a device will utilize across all concurrent upload activity via Delivery Optimization (set in KB/s)</string>
      <string id="MaxCacheSize">Max Cache Size</string>
      <string id="MaxCacheSize_Help">Set this policy to define the max cache size Delivery Optimization can utilize, as a percentage of the internal disk size.</string>
      <string id="MaxCacheAge">Max Cache Age</string>
      <string id="MaxCacheAge_Help">Set this policy to define the max time that each file is held in the Delivery Optimization cache.</string>
    </stringTable>
    <presentationTable>
      <presentation id="DownloadMode">
        <dropdownList
            defaultItem="3"
            refId="DownloadMode"
            >Download Mode:</dropdownList>
      </presentation>
      <presentation id="GroupId">
        <textBox refId="GroupId">
          <label>Group ID:</label>
        </textBox>
      </presentation>
      <presentation id="MaxUploadBandwidth">
        <decimalTextBox
            defaultItem="0"
            refId="MaxUploadBandwidth"
            >Max Upload Bandwidth:</decimalTextBox>
      </presentation>
      <presentation id="MaxCacheSize">
        <decimalTextBox
            defaultItem="20"
            refId="MaxCacheSize"
            >Max Cache Size:</decimalTextBox>
        <text>Range is 0 to 100</text>
      </presentation>
      <presentation id="MaxCacheAge">
        <decimalTextBox
            MaxCacheAge="0"
            refId="MaxCacheAge"
            >Max Cache Age:</decimalTextBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
