<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>Microsoft Edge Group Policies</displayName>
  <description>Policies defined to manage Microsoft Edge settings via Group Policy Management services.</description>
  <resources>
    <stringTable>
      <!-- Product -->
      <string id="SUPPORTED_INTERNET_BROWSER_1_DisplayName">Only Microsoft Edge 1.0</string>
      <string id="SUPPORTED_INTERNET_BROWSER_WIN10_DisplayName">Microsoft Edge on Windows 10 or later</string>
      <string id="SUPPORTED_INTERNET_BROWSER_WIN10V1511_DisplayName">Microsoft Edge on Windows 10, Version 1511 or later</string>
      <string id="SUPPORTED_INTERNET_BROWSER_WIN10V1607_DisplayName">Microsoft Edge on Windows 10, Version 1607 or later</string>
      <string id="SUPPORTED_INTERNET_BROWSER_WIN10V1703_DisplayName">Microsoft Edge on Windows 10, Version 1703 or later</string>
      <string id="SUPPORTED_INTERNET_BROWSER_WIN10RS3RELEASE_DisplayName">Microsoft Edge on Windows 10, Version 1709 or later</string>
      <string id="SUPPORTED_INTERNET_BROWSER_RS3_DisplayName">Microsoft Edge on Windows 10, Version 1708 or later</string>
      <string id="SUPPORTED_INTERNET_BROWSER_RS4_DisplayName">Microsoft Edge on Windows 10, Version 1803 or later</string>
      <string id="SUPPORTED_INTERNET_BROWSER_RS5_DisplayName">Microsoft Edge on Windows 10, Version 1809 or later</string>
      <string id="InternetBrowser_DisplayName">Microsoft Edge</string>
      <string id="InternetBrowser_ExplainCat">Microsoft Edge Category</string>

      <!-- Categories -->

      <!-- NOTE: Please try to keep this list sorted by the string id="" field -->
      <!-- Policies -->
      <string id="HomePages">Configure Start pages</string>
      <string id="HomePages_Explain">When you enable the Configure Open Microsoft Edge With policy, you can configure one or more Start pages. When you enable this policy, users are not allowed to make changes to their Start pages.

If enabled, you must include URLs to the pages, separating multiple pages using angle brackets in the following format:

      &lt;support.contoso.com&gt;&lt;support.microsoft.com&gt;

If disabled or not configured, the webpages specified in App settings loads as the default Start pages.

Version 1703 or later:
If you do not want to send traffic to Microsoft, enable this policy and use the &lt;about:blank&gt; value, which honors domain- and non-domain-joined devices, when it is the only configured URL.

Version 1809:
If enabled, and you select either Start page, New Tab page, or previous page in the Configure Open Microsoft Edge With policy, Microsoft Edge ignores the Configure Start Pages policy. If not configured or you set the Configure Open Microsoft Edge With policy to a specific page or pages, Microsoft Edge uses the Configure Start Pages policy.

Supported devices: Domain-joined or MDM-enrolled
Related policy:
- Configure Open Microsoft Edge With
- Disable Lockdown of Start Pages</string>
      <string id="DisableLockdownOfStartPages">Disable lockdown of Start pages</string>
      <string id="DisableLockdownOfStartPages_Explain">You can configure Microsoft Edge to disable the lockdown of Start pages allowing users to change or customize their start pages.  To do this, you must also enable the Configure Start Pages or Configure Open Microsoft With policy. When enabled, all configured start pages are editable. Any Start page configured using the Configure Start pages policy is not locked down allowing users to edit their Start pages.

If disabled or not configured, the Start pages configured in the Configure Start Pages policy cannot be changed and remain locked down.

Supported devices: Domain-joined or MDM-enrolled
Related policy:
- Configure Start Pages
- Configure Open Microsoft Edge With</string>
      <string id="LockdownFavorites">Prevent changes to Favorites on Microsoft Edge</string>
      <string id="LockdownFavorites_Explain">This policy setting lets you decide whether employees can add, import, sort, or edit the Favorites list on Microsoft Edge.

If you enable this setting, employees won't be able to add, import, or change anything in the Favorites list. Also as part of this, Save a Favorite, Import settings, and the context menu items (such as, Create a new folder) are all turned off.

Important
Don't enable both this setting and the Keep favorites in sync between Internet Explorer and Microsoft Edge setting. Enabling both settings stops employees from syncing their favorites between Internet Explorer and Microsoft Edge.

If you disable or don't configure this setting (default), employees can add, import and make changes to the Favorites list.</string>
      <string id="PreventCertErrorOverrides">Prevent certificate error overrides</string>
      <string id="PreventCertErrorOverrides_Explain">Web security certificates are used to ensure a site your users go to is legitimate, and in some circumstances encrypts the data. With this policy, you can specify whether to prevent users from bypassing the security warning to sites that have SSL errors.

If enabled, overriding certificate errors are not allowed.

If disabled or not configured, overriding certificate errors are allowed.</string>
      <string id="AllowAddressBarDropdown">Allow Address bar drop-down list suggestions</string>
      <string id="AllowAddressBarDropdown_Explain">This policy setting lets you decide whether the Address bar drop-down functionality is available in Microsoft Edge. We recommend disabling this setting if you want to minimize network connections from Microsoft Edge to Microsoft services.

        Note: Disabling this setting turns off the Address bar drop-down functionality. Therefore, because search suggestions are shown in the drop-down, this setting takes precedence over the "Configure search suggestions in Address bar" setting.

        If you enable or don't configure this setting, employees can see the Address bar drop-down functionality in Microsoft Edge.

        If you disable this setting, employees won't see the Address bar drop-down functionality in Microsoft Edge. This setting also disables the user-defined setting, "Show search and site suggestions as I type".</string>
      <string id="AllowAutofill">Configure Autofill</string>
      <string id="AllowAutofill_Explain">This policy setting lets you decide whether employees can use Autofill to automatically fill in form fields while using Microsoft Edge. By default, employees can choose whether to use Autofill.

If you enable this setting, employees can use Autofill to automatically fill in forms while using Microsoft Edge.

If you disable this setting, employees can't use Autofill to automatically fill in forms while using Microsoft Edge.

If you don't configure this setting, employees can choose whether to use Autofill to automatically fill in forms while using Microsoft Edge.</string>
      <string id="AllowDeveloperTools">Allow Developer Tools</string>
      <string id="AllowDeveloperTools_Explain">This policy setting lets you decide whether F12 Developer Tools are available on Microsoft Edge.

If you enable or don't configure this setting, the F12 Developer Tools are available in Microsoft Edge.

If you disable this setting, the F12 Developer Tools aren't available in Microsoft Edge.</string>
      <string id="AllowDoNotTrack">Configure Do Not Track</string>
      <string id="AllowDoNotTrack_Explain">This policy setting lets you decide whether employees can send Do Not Track requests to websites that ask for tracking info. By default, Do Not Track requests aren't sent, but employees can choose to turn on and send requests.

If you enable this setting, Do Not Tracker requests are always sent to websites asking for tracking info.

If you disable this setting, Do Not Track requests are never sent to websites asking for tracking info.

If you don't configure this setting, employees can choose whether to send Do Not Track requests to websites asking for tracking info.</string>
      <string id="AllowFullScreenMode">Allow FullScreen Mode</string>
      <string id="AllowFullScreenMode_Explain">With this policy, you can specify whether to allow full-screen mode, which shows only the web content and hides the Microsoft Edge UI.

If enabled or not configured, full-screen mode is available for use in Microsoft Edge. Your users and extensions must have the proper permissions.

If disabled, full-screen mode is unavailable for use in Microsoft Edge.</string>
      <string id="AllowInPrivate">Allow InPrivate browsing</string>
      <string id="AllowInPrivate_Explain">This policy setting lets you decide whether employees can browse using InPrivate website browsing.

If you enable or don't configure this setting, employees can use InPrivate website browsing.

If you disable this setting, employees can't use InPrivate website browsing.</string>
      <string id="AllowPasswordManager">Configure Password Manager</string>
      <string id="AllowPasswordManager_Explain">This policy setting lets you decide whether employees can save their passwords locally, using Password Manager. By default, Password Manager is turned on.

If you enable this setting, employees can use Password Manager to save their passwords locally.

If you disable this setting, employees can't use Password Manager to save their passwords locally.

If you don't configure this setting, employees can choose whether to use Password Manager to save their passwords locally.</string>
      <string id="AllowPopups">Configure Pop-up Blocker</string>
      <string id="AllowPopups_Explain">This policy setting lets you decide whether to turn on Pop-up Blocker. By default, Pop-up Blocker is turned on..

If you enable this setting, Pop-up Blocker is turned on, stopping pop-up windows from appearing.

If you disable this setting, Pop-up Blocker is turned off, letting pop-ups windows appear.

If you don't configure this setting, employees can choose whether to use Pop-up Blocker.</string>
      <string id="AllowPrinting">Allow printing</string>
      <string id="AllowPrinting_Explain">With this policy, you can restrict whether printing web content in Microsoft Edge is allowed.

If enabled, printing is allowed.

If disabled, printing is not allowed.</string>
      <string id="AllowSavingHistory">Allow Saving History</string>
      <string id="AllowSavingHistory_Explain">Microsoft Edge saves your user's browsing history, which is made up of info about the websites they visit, on their devices.

If enabled or not configured, the browsing history is saved and visible in the History pane.

If disabled, the browsing history stops saving and is not visible in the History pane. If browsing history exists before this policy was disabled, the previous browsing history remains visible in the History pane. This policy, when disabled, does not stop roaming of existing history or history coming from other roamed devices.</string>
      <string id="AllowSearchEngineCustomization">Allow search engine customization</string>
      <string id="AllowSearchEngineCustomization_Explain">This policy setting lets you decide whether users can change their search engine. If you disable this setting, users can't add new search engines or change the default used in the address bar.

Important
This setting can only be used with domain-joined or MDM-enrolled devices. For more info, see the Microsoft browser extension policy (aka.ms/browserpolicy).

If you enable or don't configure this policy, users can add new search engines and change the default used in the address bar from within Microsoft Edge Settings.

If you disable this setting, users can't add search engines or change the default used in the address bar.</string>
      <string id="AllowSearchSuggestionsinAddressBar">Configure search suggestions in Address bar</string>
      <string id="AllowSearchSuggestionsinAddressBar_Explain">This policy setting lets you decide whether search suggestions appear in the Address bar of Microsoft Edge. By default, employees can choose whether search suggestions appear in the Address bar of Microsoft Edge.

If you enable this setting, employees can see search suggestions in the Address bar of Microsoft Edge.

If you disable this setting, employees can't see search suggestions in the Address bar of Microsoft Edge.

If you don't configure this setting, employees can choose whether search suggestions appear in the Address bar of Microsoft Edge.</string>
      <string id="AllowSideloadingOfExtensions">Allow Sideloading of extension</string>
      <string id="AllowSideloadingOfExtensions_Explain">Sideloading installs and runs unverified extensions in Microsoft Edge. With this policy, you can specify whether unverified extensions can be sideloaded in Microsoft Edge.

If enabled or not configured, sideloading of unverified extensions in Microsoft Edge is allowed.

If disabled, sideloading of unverified extensions in Microsoft Edge is not allowed. Extensions can be installed only through Microsoft store (including a store for business), enterprise storefront (such as Company Portal) or PowerShell (using Add-AppxPackage).  When disabled, this policy does not prevent sideloading of extensions using Add-AppxPackage via PowerShell. To prevent this, in Group Policy Editor, enable Allows development of Windows Store apps and installing them from an integrated development environment (IDE), which is located at:

Computer Configuration &gt; Administrative Templates &gt; Windows Components &gt; App Package Deployment

Supported versions: Microsoft Edge on Windows 10, version 1809
Default setting: Disabled or not configured
Related policies:
- Allows development of Windows Store apps and installing them from an integrated development environment (IDE)
- Allow all trusted apps to install​</string>
      <string id="AllowSmartScreen">Configure Windows Defender SmartScreen</string>
      <string id="AllowSmartScreen_Explain">This policy setting lets you configure whether to turn on Windows Defender SmartScreen. Windows Defender SmartScreen provides warning messages to help protect your employees from potential phishing scams and malicious software. By default, Windows Defender SmartScreen is turned on.

If you enable this setting, Windows Defender SmartScreen is turned on and employees can't turn it off.

If you disable this setting, Windows Defender SmartScreen is turned off and employees can't turn it on.

If you don't configure this setting, employees can choose whether to use Windows Defender SmartScreen.</string>
      <string id="AllowWebContentOnNewTabPage">Allow web content on New Tab page</string>
      <string id="AllowWebContentOnNewTabPage_Explain">This policy setting lets you configure what appears when Microsoft Edge opens a new tab. By default, Microsoft Edge opens the New Tab page.

If you enable this setting, Microsoft Edge opens a new tab with the New Tab page.

If you disable this setting, Microsoft Edge opens a new tab with a blank page. If you use this setting, employees can't change it.

If you don't configure this setting, employees can choose how new tabs appears.</string>
      <string id="ConfiguredFavorites">Provision Favorites</string>
      <string id="ConfiguredFavorites_Explain">This policy setting allows you to configure a default set of favorites, which will appear for employees. Employees cannot modify, sort, move, export or delete these provisioned favorites.

If you enable this setting, you can set favorite URL's and favorite folders to appear on top of users' favorites list (either in the Hub or Favorites Bar). The user favorites will appear after these provisioned favorites.

Important
Don't enable both this setting and the Keep favorites in sync between Internet Explorer and Microsoft Edge setting. Enabling both settings stops employees from syncing their favorites between Internet Explorer and Microsoft Edge.

If you disable or don't configure this setting, employees will see the favorites they set in the Hub and Favorites Bar.</string>
      <string id="ConfigureFavoritesBar">Configure Favorites Bar</string>
      <string id="ConfigureFavoritesBar_Explain">The favorites bar shows your user's links to sites they have added to it. With this policy, you can specify whether to set the favorites bar to always be visible or hidden on any page.

If enabled, favorites bar is always visible on any page, and the favorites bar toggle in Settings sets to On, but disabled preventing your users from making changes. An error message also shows at the top of the Settings pane indicating that your organization manages some settings. The show bar/hide bar option is hidden from the context menu.

If disabled, the favorites bar is hidden, and the favorites bar toggle resets to Off, but disabled preventing your users from making changes. An error message also shows at the top of the Settings pane indicating that your organization manages some settings.

If not configured, the favorites bar is hidden but is visible on the Start and New Tab pages, and the favorites bar toggle in Settings sets to Off but is enabled allowing the user to make changes.</string>
      <string id="ConfigureHomeButton">Configure Home Button</string>
      <string id="ConfigureHomeButton_Explain">The Home button loads either the default Start page, the New tab page, or a URL defined in the Set Home Button URL policy.

By default, this policy is disabled or not configured and clicking the home button loads the default Start page.

When enabled, the home button is locked down preventing your users from making changes in Microsoft Edge's UI settings. To let your users change the Microsoft Edge UI settings, enable the Unlock Home Button policy.

If Enabled AND:
- Show home button &amp; set to Start page is selected, clicking the home button loads the Start page.
- Show home button &amp; set to New tab page is selected, clicking the home button loads a New tab page.
- Show home button &amp; set a specific page is selected, clicking the home button loads the URL specified in the Set Home Button URL policy.
- Hide home button is selected, the home button is hidden in Microsoft Edge.

Default setting: Disabled or not configured
Related policies:
- Set Home Button URL
- Unlock Home Button</string>
      <string id="ConfigureHomeButton_StartPage">Show home button &amp; set to Start page</string>
      <string id="ConfigureHomeButton_NewTabPage">Show home button &amp; set to New tab page</string>
      <string id="ConfigureHomeButton_SpecificPage">Show home button &amp; set a specific page</string>
      <string id="ConfigureHomeButton_HideHomeButton">Hide home button</string>
      <string id="ConfigureOpenEdgeWith">Configure Open Microsoft Edge With</string>
      <string id="ConfigureOpenEdgeWith_Explain">You can configure Microsoft Edge to lock down the Start page, preventing users from changing or customizing it.

If enabled, you can choose one of the following options:
- Start page: the Start page loads ignoring the Configure Start Pages policy.
- New tab page: the New tab page loads ignoring the Configure Start Pages policy.
- Previous pages: all tabs the user had open when Microsoft Edge last closed loads ignoring the Configure Start Pages policy.
- A specific page or pages: the URL(s) specified with Configure Start Pages policy load(s). If selected, you must specify at least one URL in Configure Start Pages; otherwise, this policy is ignored.

When enabled, and you want to make changes, you must first set the Disable Lockdown of Start Pages to not configured, make the changes to the Configure Open Microsoft Edge With policy, and then enable the Disable Lockdown of Start Pages policy.

If disabled or not configured, and you enable the Disable Lockdown of Start Pages policy, your users can change or customize the Start page.

Default setting: A specific page or pages (default)
Related policies:
-Disable Lockdown of Start Pages
-Configure Start Pages</string>
      <string id="ConfigureOpenEdgeWithList_EdgeStartPage">Start page</string>
      <string id="ConfigureOpenEdgeWithList_NewTabPage">New tab page</string>
      <string id="ConfigureOpenEdgeWithList_PreviousPages">Previous pages</string>
      <string id="ConfigureOpenEdgeWithList_ProvisionedHomePages">A specific page or pages (default)</string>
      <string id="AlwaysEnableBooksLibrary">Always show the Books Library in Microsoft Edge</string>
      <string id="AlwaysEnableBooksLibrary_Explain">This policy setting helps you to decide whether to make the Books tab visible, regardless of a device's country or region setting, as configured in the Country or region area of Windows settings.

If you enable this setting, Microsoft Edge shows the Books Library, regardless of the device's country or region.

If you disable or don't configure this setting, Microsoft Edge shows the Books Library only in countries or regions where it's supported.</string>
      <string id="EnableExtendedBooksTelemetry">Allow extended telemetry for the Books tab</string>
      <string id="EnableExtendedBooksTelemetry_Explain">This policy setting lets you decide how much data to send to Microsoft about the book you're reading from the Books tab in Microsoft Edge.

If you enable this setting, Microsoft Edge sends additional telemetry data, on top of the basic telemetry data, from the Books tab.

If you disable or don't configure this setting, Microsoft Edge only sends basic telemetry data, depending on your device configuration.</string>
      <string id="UseSharedFolderForBooks">Allow a shared Books folder</string>
      <string id="UseSharedFolderForBooks_Explain">This policy setting lets you decide whether Microsoft Edge stores books from the Books tab to a default, shared folder for Windows.

If you enable this setting, Microsoft Edge automatically downloads book files to a common, shared folder and prevents students and teachers from removing the book from the Books tab. For this to work properly, your students and teachers must be signed in using a school account.

If you disable or don't configure this setting, Microsoft Edge downloads book files to a per-user folder for each student or teacher.</string>
      <string id="AllowConfigurationUpdateForBooksLibrary">Allow configuration updates for the Books Library</string>
      <string id="AllowConfigurationUpdateForBooksLibrary_Explain">This policy setting lets you decide whether Microsoft Edge can automatically update the configuration data for the Books Library.

If you enable (default) or don't configure this setting, Microsoft Edge automatically updates the configuration data for the Books Library.

If you disable this setting, Microsoft Edge won't automatically download updated configuration data for the Books Library.</string>
      <string id="Cookies">Configure cookies</string>
      <string id="Cookies_Explain">This setting lets you configure how to work with cookies.

If you enable this setting, you must also decide whether to:
     Allow all cookies (default): Allows all cookies from all websites.
     Block all cookies: Blocks all cookies from all websites.
     Block only 3rd-party cookies: Blocks only cookies from 3rd-party websites.

If you disable or don't configure this setting, all cookies are allowed from all sites.</string>
      <string id="CookiesList_Block_None">Allow all cookies (default)</string>
      <string id="CookiesList_Block_ThirdParty">Block only 3rd-party cookies</string>
      <string id="CookiesList_Block_All">Block all cookies</string>
      <string id="EnterpriseModeSiteList">Configure the Enterprise Mode Site List</string>
      <string id="EnterpriseModeSiteList_Explain">This policy setting lets you configure whether to use Enterprise Mode and the Enterprise Mode Site List to address common compatibility problems with legacy apps.

If you enable this setting, Microsoft Edge looks for the Enterprise Mode Site List XML file. This file includes the sites and domains that need to be viewed using Internet Explorer 11 and Enterprise Mode.

If you disable or don't configure this setting, Microsoft Edge won't use the Enterprise Mode Site List XML file. In this case, employees might experience compatibility problems while using legacy apps.</string>
      <string id="AllowExtensions">Allow Extensions</string>
      <string id="AllowExtensions_Explain">This setting lets you decide whether employees can load extensions in Microsoft Edge.

If you enable or don't configure this setting, employees can use Microsoft Edge Extensions.

If you disable this setting, employees can't use Microsoft Edge Extensions.</string>
        <string id="PreventTurningOffRequiredExtensions">Prevent turning off required extensions</string>
        <string id="PreventTurningOffRequiredExtensions_Explain">You can define a list of extensions in Microsoft Edge that users cannot turn off. You must deploy extensions through any available enterprise deployment channel, such as Microsoft Intune. When you enable this policy, users cannot uninstall extensions from their computer, but they can configure options for extensions defined in this policy, such as allow for InPrivate browsing. Any additional permissions requested by future updates of the extension gets granted automatically.

When you enable this policy, you must provide a semi-colon delimited list of extension package family names (PFNs).  For example, adding Microsoft.OneNoteWebClipper_8wekyb3d8bbwe;Microsoft.OfficeOnline_8wekyb3d8bbwe  prevents a user from turning off the OneNote Web Clipper and Office Online extension.

When enabled, removing extensions from the list does not uninstall the extension from the user’s computer automatically. To uninstall the extension, use any available enterprise deployment channel.

If you enable the Allow Developer Tools policy, then this policy does not prevent users from debugging and altering the logic on an extension.

If disabled or not configured, extensions defined as part of this policy get ignored.

Default setting:  Disabled or not configured
Related policies: Allow Developer Tools
Related Documents:
- Find a package family name (PFN) for per-app VPN (https://docs.microsoft.com/en-us/sccm/protect/deploy-use/find-a-pfn-for-per-app-vpn)
- How to manage apps you purchased from the Microsoft Store for Business with Microsoft Intune (https://docs.microsoft.com/en-us/intune/windows-store-for-business)
- How to assign apps to groups with Microsoft Intune (https://docs.microsoft.com/en-us/intune/apps-deploy)
- Manage apps from the Microsoft Store for Business with System Center Configuration Manager  (https://docs.microsoft.com/en-us/sccm/apps/deploy-use/manage-apps-from-the-windows-store-for-business)
- How to add Windows line-of-business (LOB) apps to Microsoft Intune (https://docs.microsoft.com/en-us/intune/lob-apps-windows)</string>
      <string id="HideLocalHostIPAddress">Prevent using Localhost IP address for WebRTC</string>
      <string id="HideLocalHostIPAddress_Explain">This policy setting lets you decide whether an employee's LocalHost IP address shows while making calls using the WebRTC protocol.

If you enable this setting, LocalHost IP addresses are hidden while making calls using the WebRTC protocol.

If you disable or don't configure this setting, LocalHost IP addresses are shown while making calls using the WebRTC protocol.</string>
      <string id="ItemNameDisable">Disable</string>
      <string id="ItemNameEnable">Enable</string>
      <string id="PreventSmartScreenPromptOverride">Prevent bypassing Windows Defender SmartScreen prompts for sites</string>
      <string id="PreventSmartScreenPromptOverride_Explain">This policy setting lets you decide whether employees can override the Windows Defender SmartScreen warnings about potentially malicious websites.

If you enable this setting, employees can't ignore Windows Defender SmartScreen warnings and they are blocked from continuing to the site.

If you disable or don't configure this setting, employees can ignore Windows Defender SmartScreen warnings and continue to the site.</string>
      <string id="PreventSmartScreenPromptOverrideForFiles">Prevent bypassing Windows Defender SmartScreen prompts for files</string>
      <string id="PreventSmartScreenPromptOverrideForFiles_Explain">This policy setting lets you decide whether employees can override the Windows Defender SmartScreen warnings about downloading unverified files.

If you enable this setting, employees can't ignore Windows Defender SmartScreen warnings and they are blocked from downloading the unverified files.

If you disable or don't configure this setting, employees can ignore Windows Defender SmartScreen warnings and continue the download process.</string>
      <string id="SetDefaultSearchEngine">Set default search engine</string>
      <string id="SetDefaultSearchEngine_Explain">This policy setting lets you configure the default search engine for your employees. Your employees can change the default search engine at any time.

Important
This setting can only be used with domain-joined or MDM-enrolled devices. For more info, see the Microsoft browser extension policy (aka.ms/browserpolicy).

If you enable this setting, you can choose a default search engine for your employees. If this setting is enabled, you must also add the default engine to the “Set default search engine” setting, by adding a link to your OpenSearch XML file, including at least the short name and https: URL of the search engine. For more info about creating the OpenSearch XML file, see the Understanding OpenSearch Standards (https://msdn.microsoft.com/en-us/library/dd163546.aspx) topic. Use this format to specify the link you wish to add: &lt;https://fabrikam.com/opensearch.xml&gt;

Note
If you'd like your employees to use the default Microsoft Edge settings for each market, you can set the string to EDGEDEFAULT. If you'd like your employees to use Microsoft Bing as the default search engine, you can set the string to EDGEBING.

Employees can change the default search engine at any time, unless you disable the "Allow search engine customization" setting, which restricts any changes.

If you disable this setting, the policy-set default search engine is removed. If this is also the current in-use default, the engine changes to the Microsoft Edge specified engine for the market.

If you don't configure this setting, the default search engine is set to the one specified in App settings.</string>
      <string id="ConfigureAdditionalSearchEngines">Configure additional search engines</string>
      <string id="ConfigureAdditionalSearchEngines_Explain">This policy setting lets you add up to 5 additional search engines, which can't be removed by your employees, but can be made a personal default engine. This setting doesn't set the default search engine. For that, you must use the "Set default search engine" setting.

Important
This setting can only be used with domain-joined or MDM-enrolled devices. For more info, see the Microsoft browser extension policy (aka.ms/browserpolicy).

If you enable this setting, you can add up to 5 additional search engines. For each additional engine, you must also add a link to your OpenSearch XML file, including at least the short name and https: URL of the search engine. For more info about creating the OpenSearch XML file, see the Understanding OpenSearch Standards (https://msdn.microsoft.com/en-us/library/dd163546.aspx) topic. Use this format to specify the link(s) you wish to add: &lt;https://fabrikam.com/opensearch.xml&gt;&lt;https://www.contoso.com/opensearch.xml&gt;

If you disable this setting, any added search engines are removed from your employee's devices.

If you don't configure this setting, the search engine list is set to what is specified in App settings.</string>
      <string id="ProvisionedFavorites">Configure Favorites</string>
      <string id="ProvisionedFavorites_Explain">This policy setting lets you configure the default list of Favorites that appear for your employees. Employees can change their favorites by adding or removing items at any time.

If you enable this setting, you can configure what default Favorites appear for your employees. If this setting is enabled, you must also provide a list of Favorites in the Options section. This list is imported after your policy is deployed.

If you disable or don't configure this setting, employees will see the Favorites that they set in the Favorites hub.</string>
      <string id="SetHomeButtonURL">Set Home Button URL</string>
      <string id="SetHomeButtonURL_Explain">The home button can be configured to load a custom URL when your user clicks the home button.

If enabled, or configured, and the Configure Home Button policy is enabled, and the Show home button &amp; set a specific page is selected, a custom URL loads when your user clicks the home button.

Default setting: Blank or not configured
Related policy: Configure Home Button</string>
      <string id="SendIntranetTraffictoInternetExplorer">Send all intranet sites to Internet Explorer 11</string>
      <string id="SendIntranetTraffictoInternetExplorer_Explain">This policy setting lets you decide whether your intranet sites should all open using Internet Explorer 11. This setting should only be used if there are known compatibility problems with Microsoft Edge.

If you enable this setting, all intranet sites are automatically opened using Internet Explorer 11.

If you disable or don't configure this setting, all intranet sites are automatically opened using Microsoft Edge.</string>
      <string id="SetNewTabPageURL">Set New Tab page URL</string>
      <string id="SetNewTabPageURL_Explain">You can set the default New Tab page URL in Microsoft Edge.  Enabling this policy prevents your users from changing the New tab page setting. When enabled and the Allow web content on New Tab page policy is disabled, Microsoft Edge ignores the URL specified in this policy and opens about:blank.

If enabled, you can set the default New Tab page URL.

If disabled or not configured, the default Microsoft Edge new tab page is used.

Default setting:  Disabled or not configured
Related policy: Allow web content on New Tab page</string>
      <string id="ShowMessageWhenOpeningSitesInInternetExplorer_Show_ContinueInEdge">Show Keep going in Microsoft Edge link</string>
      <string id="ShowMessageWhenOpeningSitesInInternetExplorer_Hide_ContinueInEdge">Hide Keep going in Microsoft Edge link</string>
      <string id="ShowMessageWhenOpeningSitesInInternetExplorer">Show message when opening sites in Internet Explorer</string>
      <string id="ShowMessageWhenOpeningSitesInInternetExplorer_Explain">You can configure Microsoft Edge to open a site automatically in Internet Explorer 11 and choose to display a notification before the site opens. If you want to display a notification, you must enable Configure the Enterprise Mode Site List or Send all intranets sites to Internet Explorer 11 or both.

If enabled, the notification appears on a new page. If you want users to continue in Microsoft Edge, select the Show Keep going in Microsoft Edge option from the drop-down list under Options.

If disabled or not configured, the default app behavior occurs and no additional page displays.

Default setting: Disabled or not configured
Related policies:
-Configure the Enterprise Mode Site List
-Send all intranet sites to Internet Explorer 11</string>
      <string id="PreventAccessToAboutFlagsInMicrosoftEdge">Prevent access to the about:flags page in Microsoft Edge</string>
      <string id="PreventAccessToAboutFlagsInMicrosoftEdge_Explain">This policy settings lets you decide whether employees can access the about:flags page, which is used to change developer settings and to enable experimental features.

If you enable this policy setting, employees can't access the about:flags page.

If you disable or don't configure this setting, employees can access the about:flags page.</string>
      <string id="PreventLiveTileDataCollection">Prevent Microsoft Edge from gathering Live Tile information when pinning a site to Start</string>
      <string id="PreventLiveTileDataCollection_Explain">This policy lets you decide whether Microsoft Edge can gather Live Tile metadata from the ieonline.microsoft.com service to provide a better experience while pinning a Live Tile to the Start menu.

If you enable this setting, Microsoft Edge won't gather the Live Tile metadata, providing a minimal experience when a user pins a Live Tile to the Start menu.

If you disable or don't configure this setting, Microsoft Edge gathers the Live Tile metadata, providing a fuller and more complete experience when a user pins a Live Tile to the Start menu.</string>
      <string id="PreventFirstRunPage">Prevent the First Run webpage from opening on Microsoft Edge</string>
      <string id="PreventFirstRunPage_Explain">
This policy setting lets you decide whether employees see Microsoft's First Run webpage when opening Microsoft Edge for the first time.

If you enable this setting, employees won't see the First Run page when opening Microsoft Edge for the first time.

If you disable or don't configure this setting, employees will see the First Run page when opening Microsoft Edge for the first time.</string>
      <string id="SyncFavoritesBetweenIEAndMicrosoftEdge">Keep favorites in sync between Internet Explorer and Microsoft Edge</string>
      <string id="SyncFavoritesBetweenIEAndMicrosoftEdge_Explain">This setting lets you decide whether people can sync their favorites between Internet Explorer and Microsoft Edge.

If you enable this setting, employees can sync their favorites between Internet Explorer and Microsoft Edge.

If you disable or don't configure this setting, employees can’t sync their favorites between Internet Explorer and Microsoft Edge.
      </string>
      <string id="UnlockHomeButton">Unlock Home Button</string>
      <string id="UnlockHomeButton_Explain">By default, when enabling Configure Home Button or Set Home Button URL, the home button is locked down to prevent your users from changing what page loads when clicking the home button. Use this policy to let users change the home button even when Configure Home Button or Set Home Button URL are enabled.

If enabled, the UI settings for the home button are enabled allowing your users to make changes, including hiding and showing the home button as well as configuring a custom URL.

If disabled or not configured, the UI settings for the home button are disabled preventing your users from making changes.

Default setting: Disabled or not configured
Related policy:
-Configure Home Button
-Set Home Button URL</string>
      <string id="AllowFlashClickToRun">Configure the Adobe Flash Click-to-Run setting</string>
      <string id="AllowFlashClickToRun_Explain">
        If you enable or don’t configure the Adobe Flash Click-to-Run setting, Microsoft Edge will require a user to click the Click-to-Run button, to click the content, or for the site to appear on the auto-allowed list, before loading and running the content.

Sites get onto the auto-allowed list based on user feedback, specifically by how often the content is allowed to load and run.
      </string>

      <string id="AllowClearingBrowsingDataOnExit">Allow clearing browsing data on exit</string>
      <string id="AllowClearingBrowsingDataOnExit_Explain">This policy setting allows the automatic clearing of browsing data when Microsoft Edge closes.

If you enable this policy setting, clearing browsing history on exit is turned on.

If you disable or don't configure this policy setting, it can be turned on and configured by the employee in the Clear browsing data options under Settings.
      </string>

      <string id="AllowFlash">Allow Adobe Flash</string>
      <string id="AllowFlash_Explain">This setting lets you decide whether employees can run Adobe Flash in Microsoft Edge.

If you enable or don't configure this setting, employees can use Adobe Flash.

If you disable this setting, employees can't use Adobe Flash.

      </string>

      <string id="AllowCVList">Allow Microsoft Compatibility List</string>
      <string id="AllowCVList_Explain">This policy setting lets you decide whether to use the Microsoft Compatibility List (a Microsoft-provided list that helps sites with known compatibility issues to display properly) in Microsoft Edge. By default, the Microsoft Compatibility List is enabled and can be viewed by visiting about:compat.

If you enable or don’t configure this setting, Microsoft Edge periodically downloads the latest version of the list from Microsoft, applying the updates during browser navigation. Visiting any site on the Microsoft Compatibility List prompts the employee to use Internet Explorer 11, where the site is automatically rendered as though it’s in whatever version of IE is necessary for it to appear properly.

If you disable this setting, the Microsoft Compatibility List isn’t used during browser navigation.</string>

      <string id="AllowTabPreloading">Allow Microsoft Edge to start and load the Start and New Tab page at Windows startup and each time Microsoft Edge is closed</string>
      <string id="AllowTabPreloading_Explain">This policy setting lets you decide whether Microsoft Edge can load the Start and New Tab page during Windows sign in and each time Microsoft Edge is closed. By default this setting is to allow preloading.

If you allow preloading, disable, or don’t configure this policy setting, Microsoft Edge loads the Start and New Tab page during Windows sign in and each time Microsoft Edge is closed; minimizing the amount of time required to start up Microsoft Edge and to start a new tab.

If you prevent preloading, Microsoft Edge won’t load the Start or New Tab page during Windows sign in and each time Microsoft Edge is closed.</string>
      <string id="AllowTabPreloadingDropdown_AllowTabPreloading">Allow tab preloading</string>
      <string id="AllowTabPreloadingDropdown_PreventTabPreloading">Prevent tab preloading</string>
      <string id="ConfigureTelemetryForMicrosoft365Analytics">Configure collection of browsing data for Microsoft 365 Analytics</string>
      <string id="ConfigureTelemetryForMicrosoft365Analytics_Explain">You can configure Microsoft Edge to send intranet history only, internet history only, or both to Microsoft 365 Analytics for enterprise devices with a configured Commercial ID. If disabled or not configured, Microsoft Edge does not send browsing history data to Microsoft 365 Analytics.

Supported versions: Microsoft Edge on Windows 10, version 1809
Default setting: Disabled or not configured (no data collected or sent)</string>
      <string id="ZonesList_IntranetOnly">Allow sending intranet history only</string>
      <string id="ZonesList_InternetOnly">Allow sending internet history only</string>
      <string id="ZonesList_Both">Allow sending both intranet and internet history</string>
      <string id="ZonesList_None">Do not allow sending intranet or internet history</string>

      <string id="AllowPrelaunch">Allow Microsoft Edge to pre-launch at Windows startup, when the system is idle, and each time Microsoft Edge is closed</string>
      <string id="AllowPrelaunch_Explain">This policy setting lets you decide whether Microsoft Edge can pre-launch during Windows sign in, when the system is idle, and each time Microsoft Edge is closed. By default this setting is to allow pre-launch.

If you allow pre-launch, disable, or don’t configure this policy setting, Microsoft Edge pre-launches during Windows sign in, when the system is idle, and each time Microsoft Edge is closed; minimizing the amount of time required to start up Microsoft Edge.

If you prevent pre-launch, Microsoft Edge won’t pre-launch during Windows sign in, when the system is idle, or each time Microsoft Edge is closed.</string>
      <string id="AllowPrelaunchDropdown_AllowPrelaunch">Allow pre-launching</string>
      <string id="AllowPrelaunchDropdown_PreventPrelaunch">Prevent pre-launching</string>

      <string id="ConfigureKioskMode">Configure kiosk mode</string>
      <string id="ConfigureKioskMode_Explain">Configure how Microsoft Edge behaves when it’s running in kiosk mode with assigned access, either as a single app or as one of multiple apps running on the kiosk device. You can control whether Microsoft Edge runs InPrivate full screen, InPrivate multi-tab with limited functionality, or normal Microsoft Edge.

You need to configure Microsoft Edge in assigned access for this policy to take effect; otherwise, these settings are ignored. To learn more about assigned access and kiosk configuration, see “Configure kiosk and shared devices running Windows desktop editions” (https://aka.ms/E489vw).

If enabled and set to 0 (Default or not configured):
- If it’s a single app, it runs InPrivate full screen for digital signage or interactive displays.
- If it’s one of many apps, Microsoft Edge runs as normal.
If enabled and set to 1:
- If it’s a single app, it runs a limited multi-tab version of InPrivate and is the only app available for public browsing. Users can’t minimize, close, or open windows or customize Microsoft Edge, but can clear browsing data and downloads and restart by clicking “End session.” You can configure Microsoft Edge to restart after a period of inactivity by using the “Configure kiosk reset after idle timeout” policy.
- If it’s one of many apps, it runs in a limited multi-tab version of InPrivate for public browsing with other apps. Users can minimize, close, and open multiple InPrivate windows, but they can’t customize Microsoft Edge.</string>
      <string id="ConfigureKioskResetAfterIdleTimeout">Configure kiosk reset after idle timeout</string>
      <string id="ConfigureKioskResetAfterIdleTimeout_Explain">You can configure Microsoft Edge to reset to the configured start experience after a specified amount of idle time. The reset timer begins after the last user interaction. Resetting to the configured start experience deletes the current user’s browsing data.

If enabled, you can set the idle time in minutes (0-1440). You must set the Configure kiosk mode policy to 1 and configure Microsoft Edge in assigned access as a single app for this policy to work. Once the idle time meets the time specified, a confirmation message prompts the user to continue, and if no user action, Microsoft Edge resets after 30 seconds.

If you set this policy to 0, Microsoft Edge does not use an idle timer.

If disabled or not configured, the default value is 5 minutes.

If you do not configure Microsoft Edge in assigned access, then this policy does not take effect.</string>
    </stringTable>

    <!-- Presentation -->
    <presentationTable>
      <presentation id="ConfiguredFavorites_Presentation">
        <textBox refId="ConfiguredFavoritesPrompt">
          <label>Specify the URL which points to the file that has all the data for provisioning favorites (in html format). You can export a set of favorites from Microsoft Edge and use that html file for provisioning user machines.

URL can be specified as
1. HTTP location: http://localhost:8080/URLs.html
2. Local network: \\network\shares\URLs.html
3. Local file: file:///c:\\Users\\&lt;user&gt;\\Documents\\URLs.html or C:\\Users\\&lt;user&gt;\\Documents\\URLs.html
          </label>
        </textBox>
      </presentation>
      <presentation id="ConfigureOpenEdgeWith_Presentation">
        <dropdownList refId="ConfigureOpenEdgeWithListBox" noSort="true" defaultItem="3">Configure Open Microsoft Edge With</dropdownList>
      </presentation>
      <presentation id="ConfigureHomeButton_Presentation">
        <dropdownList refId="ConfigureHomeButtonDropdown" noSort="true" defaultItem="0">Configure the Home Button</dropdownList>
      </presentation>
      <presentation id="EnterpriseModeSiteList_Presentation">
        <textBox refId="EnterSiteListPrompt">
          <label>Type the location (URL) of your Enterprise Mode IE website list</label>
        </textBox>
      </presentation>
      <presentation id="HomePageSite_Presentation">
        <textBox refId="HomePageSitePrompt">
          <label>Type the location (URL) of your Home Page website</label>
        </textBox>
      </presentation>
      <presentation id="HomePages_Presentation">
        <textBox refId="HomePagesPrompt">
          <label>Use this format:  &lt;support.contoso.com&gt;&lt;https://support.microsoft.com/&gt;</label>
        </textBox>
      </presentation>
      <presentation id="SetDefaultSearchEngine_Presentation">
        <textBox refId="SetDefaultSearchEngine_Prompt">
          <label>Use this format to specify the link you wish to add: &lt;https://fabrikam.com/opensearch.xml&gt;</label>
        </textBox>
      </presentation>
      <presentation id="SetHomeButtonURL_Presentation">
        <textBox refId="SetHomeButtonURLPrompt">
          <label>Enter a URL in string format. For example: https://www.bing.com</label>
        </textBox>
      </presentation>
      <presentation id="SetNewTabPageURL_Presentation">
        <textBox refId="SetNewTabPageURLPrompt">
          <label>Enter a URL in string format. For example: https://www.bing.com</label>
        </textBox>
      </presentation>
      <presentation id="ConfigureAdditionalSearchEngines_Presentation">
        <textBox refId="ConfigureAdditionalSearchEngines_Prompt">
          <label>Use this format to specify the link(s) you wish to add: &lt;https://fabrikam.com/opensearch.xml&gt;&lt;https://www.contoso.com/opensearch.xml&gt;</label>
        </textBox>
      </presentation>
      <presentation id="ProvisionedFavorites_Presentation">
        <listBox refId="ProvisionedFavorites_List">Enter the name of the favorite in the first column and the URL of the favorite in the other column like Contoso http://www.contoso.com/</listBox>
      </presentation>
      <presentation id="PreventTurningOffRequiredExtensions_Presentation">
          <textBox refId="PreventTurningOffRequiredExtensions_Prompt">
              <label>In the space below, enter extension package family names (PFNs) separated by semi-colons.</label>
          </textBox>
      </presentation>
      <presentation id="Cookies">
        <dropdownList refId="CookiesListBox" noSort="true" defaultItem="2">Configure Cookies </dropdownList>
      </presentation>
      <presentation id="AllowTabPreloading">
        <dropdownList refId="AllowTabPreloadingDropdown" defaultItem="0">Configure tab preloading</dropdownList>
      </presentation>
      <presentation id="AllowPrelaunch">
        <dropdownList refId="AllowPrelaunchDropdown" defaultItem="0">Configure pre-launch</dropdownList>
      </presentation>
      <presentation id="ConfigureTelemetryForMicrosoft365Analytics_Presentation">
        <dropdownList refId="ZonesListBox" noSort="true" defaultItem="0">Configure telemetry collection</dropdownList>
      </presentation>
      <presentation id="ConfigureKioskMode_Presentation">
        <text>Configure how Microsoft Edge behaves in kiosk mode.

For single app assigned access:
   - 0 = Full-screen digital signage and interactive display
   - 1 = InPrivate public browsing (limited features)

For multi-app assigned access:
   - 0 = Normal Microsoft Edge running in assigned access
   - 1 = InPrivate public browsing
        </text>
        <decimalTextBox refId="ConfigureKioskMode_TextBox" defaultValue="0"></decimalTextBox>
      </presentation>
      <presentation id="ConfigureKioskResetAfterIdleTimeout_Presentation">
        <text>Specify the time in minutes from the last user activity before Microsoft Edge kiosk resets, you can choose:
   - 0 to disable the idle timer
   - 1-1440 minutes of inactivity since the last user interaction
        </text>
        <decimalTextBox refId="ConfigureKioskResetAfterIdleTimeout_TextBox" defaultValue="5"></decimalTextBox>
      </presentation>
      <presentation id="ShowMessageWhenOpeningSitesInInternetExplorer_Presentation">
        <dropdownList refId="ShowMessageWhenOpeningSitesInInternetExplorer_Dropdown" noSort="true" defaultItem="0">Show Keep going in Microsoft Edge link</dropdownList>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
